{
  "name": "Welcome to Squish!",
  "icon": "squish:squish_candy",
  "category": "squish:getting_started",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Squish introduces a new sugary way to make your pets and animals stay babies forever! Maybe adds some sweet treats along the way too!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:melted_sugar",
      "title": "Melted Sugar",
      "text": "Melt sugar over a campfire to create Melted Sugar! It can be placed to harden into Hardened Sugar after a few minutes. You can also wax it with Honeycomb to keep it from hardening. Unwax with any axe."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:hardened_sugar_shard",
      "title": "Hardened Sugar Shard",
      "text": "Breaking Hardened Sugar yields Hardened Sugar Shards! Use a Fortune pickaxe to get even more. You can also break Hardened Sugar with a Silk Touch pickaxe to use it as a building block (or craft into 4 shards)."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:squish_essence",
      "title": "Squish Essence",
      "text": "To brew Squish Essence, place a Hardened Sugar Shard and Bottles of Water into a Brewing Stand. Make sure you have blaze powder! This shimmering liquid is essential to all Squish-based recipes!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:lollipop",
      "title": "Lollipop",
      "text": "Craft a Lollipop using a Hardened Sugar Shard and a Stick. It provides quick hunger and saturation, but it's also a key ingredient for making Squish Candy!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:squish_candy",
      "title": "Squish Candy",
      "text": "Throw Lollipops on the ground and splash them with Squish Essence to magically transform them into Squish Candy! Use these on your pets or animals by shift right clicking them to keep them babies forever. But beware... if you eat one yourself, things might get a bit crazy! Splash with more Squish Essence to up the Infusion level to make the Sugar Rush effect last longer!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:bitter_sugar_shard",
      "title": "Bitter Sugar Shard",
      "text": "Smelt or smoke a Hardened Sugar Shard to create a Bitter Sugar Shard. This darkened sugar is used to create Bitter Candy!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:bitter_candy",
      "title": "Bitter Candy",
      "text": "Craft a Bitter Candy using a Bitter Sugar Shard and a Stick. Shift right-click on a squished animal to reverse the effect and grow them back to adult size! Eating it yourself is not recommended!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:explosive_essence",
      "title": "Explosive Essence",
      "text": "Combine Gunpowder with Squish Essence in a crafting table to create this volatile concoction! Throw it at Lollipops on the ground to transform them into Explosive Candy."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:explosive_candy",
      "title": "Explosive Candy",
      "text": "This dangerous treat can tame Baby Creepers! Feed it to a Baby Creeper to make it your loyal companion. Don't Eat. Don't do it. Do not do it. Don't."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:poppy_essence",
      "title": "Poppy Essence",
      "text": "Combine a Poppy with Squish Essence in a crafting table to create this floral elixir! Throw it at Lollipops on the ground to transform them into Poppy Candy."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:poppy_candy",
      "title": "Poppy Candy",
      "text": "This treat can tame Baby Iron Golems! Feed it to a Baby Iron Golem to make it your loyal friend. Eating it yourself grants 30 seconds of Regeneration II!"
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:ender_essence",
      "title": "Ender Essence",
      "text": "Combine an Ender Pearl with Squish Essence in a crafting table to create this mystical elixir! Throw it at Lollipops on the ground to transform them into Ender Candy."
    },
    {
      "type": "patchouli:spotlight",
      "item": "squish:ender_candy",
      "title": "Ender Candy",
      "text": "This treat can tame Baby Endermen! Feed it to a Baby Enderman to make it your loyal companion. Eating it yourself will teleport you randomly, just like a Chorus Fruit!"
    }
  ]
}
